name: "preprocessing_model"
backend: "python"
max_batch_size: 8
input [
  {
    name: "INPUT"
    data_type: TYPE_UINT8
    dims: [ -1,-1, 3]  # Adjust based on your input shape, typically HWC
  }
]
output [
  {
    name: "PREPROCESSED_OUTPUT"
    data_type: TYPE_FP32
    dims: [3, 320, 320]
  }
]
dynamic_batching {
}