name: "yolo_onnx"
platform: "onnxruntime_onnx"
max_batch_size : 8
input [
  {
    name: "images"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3,-1,-1]
  }
]
output [
  {
    name: "output0"
    data_type: TYPE_FP32
    dims: [  10 ,-1 ]
    label_filename: "labels.txt"
  }
]
dynamic_batching {
}
