name: "ensemble_model"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "RAW_INPUT"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
  }
]
output [
  {
    name: "output0"
    data_type: TYPE_FP32
    dims: [  10 ,-1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessing_model"
      model_version: -1
      input_map {
        key: "INPUT"
        value: "RAW_INPUT"
      }
      output_map {
        key: "PREPROCESSED_OUTPUT"
        value: "YOLO_INPUT"
      }
    },
    {
      model_name: "yolo_onnx"
      model_version: -1
      input_map {
        key: "images"
        value: "YOLO_INPUT"
      }
      output_map {
        key: "output0"
        value: "output0"
      }
    }

  ]
}
